Repository: no4ni/scaleSmooth
Catalog: Strings.*.resx
Languages: ru

source: Accurate
ru: Точно

# BetterVideocard
source: Better videocard required! (Recommended NVIDIA GeForce 410+)
ru: Более мощная видеокарта требуется! (Рекомендуется NVIDIA, начиная от GeForce 410)

# boldScale
source: Grid structure, little bit noisy and contrasty (for accuracy, subsequent reverse correction is desirable) and too small details may lost Very fast - Very very slow, but you can process multiple images at the same time without losing speed
ru: Сеточная структура, немного шумно и контрастно (для точности обратная корректировка рекомендуется) и слишком маленькие детали могут потеряться Очень быстро - Очень очень медленно, но Вы можете обрабатывать несколько изображений одновременно без существенной потери скорости

# Close
source: Close program and cancel processing If this doesn't work, wait or kill process scaleSmooth from TaskManager (Ctrl+Shift+Esc)
ru: Закрыть программу и отменить обработку Если это не работает, подождите или снимите задачу scaleSmooth из диспетчера задач (Ctrl+Shift+Esc)

# CloseButton
source: Close
ru: Закрыть

source: Color
ru: Цветное

# contrastBoldScale
source: Perfect result, but too contrasty (for accuracy, subsequent reverse correction is required) and too small details are lost Very fast - Very very slow, but you can process multiple images at the same time without losing speed
ru: Прекрасный результат, но чересчур контрастно (для точности обратная корректировка обязательна) и слишком маленькие детали могут потеряться Очень быстро - Очень очень медленно, но Вы можете обрабатывать несколько изображений одновременно без существенной потери скорости

# CopyStopwatch
source: Click middle mouse button to copy stopwatch value
ru: Средняя кнопка мыши (клик на колесико) для копирования значения секундомера

# Demo
source: Example result of selected method
ru: Пример результата высокого разрешения через выбранный метод

# DemoBilinear
source: Example result of bilinear interpolation
ru: Пример изображения низкого разрешения

source: Fast
ru: Быстро

# FastAccurate
source: Select Fast (0) or Accurate (100) variant or something in between Space to default value (42)
ru: Выберите режим - Быстро (0), Точно (100) или что-то среднее Нажмите пробел для Баланса (42)

# FormMoveInfo
source: Win+D and click desktop to minimize window before Upscale: Drag to move window RMB x2 to fit window in screen
ru: Win+D и клик на рабочий стол для того, чтобы свернуть приложение до Начала: Перетащите окно Дважды правой кнопкой мыши, чтобы вписать окно в экран

source: GPU Acceleration
ru: Ускорение ГП

# Gray
source: Processing only 1 channel: Luma calculated as Y=0.299*R+0.587*G+0.114*B
ru: Обработка только одного канала: Яркость (Luma) рассчитывается как Y=0.299*R+0.587*G+0.114*B

# GrayImage
source: Gray
ru: Серое

# ImageBuffer
source: Image buffer Shows input and output image Allows you to do several operations before saving total result
ru: Картинка-буфер Показывает загруженное изображение и результат Позволяет совершать Вам несколько операций до сохранения

# Load
source: Load raster image from file
ru: Загрузить растровое изображение из файла

# LoadButton
source: Load
ru: Загрузить

# Method
source: Select method for upscaling
ru: Выбрать метод для увеличения

# MoreVRAM
source: Better video card required! (More VRAM required for this size and/or accuracy)
ru: Более дорогая видеокарта требуется! (Не хватает памяти (VRAM) для такого размера выходного изображения и/или точности)

# Next
source: Next method for upscaling
ru: Следующий метод

# Notification
source: sound notification
ru: звуковое уведомление

# Previous
source: Previous method for upscaling
ru: Предыдущий метод

source: Raster images
ru: Растровые изображения

# Restore
source: Discard changes and reload image
ru: Отменить изменения

# RestoreButton
source: Restore
ru: Сброс

# RGB
source: Processing 3 channels: Red,Green,Blue
ru: Обработка трёх каналов: Красный, Зелёный, Синий

# Save
source: Save result as PNG file
ru: Сохранить как PNG

# SaveButton
source: Save
ru: Сохранить

# Scale
source: Scale: x
ru: Масштаб: x

# scaleBAContrast
source: Defined grid structure, little contrasty and may be present Gibbs ringing artifacts Very very fast - Very slow, and you can't process multiple images at the same time without losing speed
ru: Видна сеточная структура, немного контрастно и может присутствовать звон Очень очень быстро - Очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# scale255BA
source: Vaguely, but not blurry, may need back adjustment Very very slow and you can't process multiple images at once
ru: Расплывчато, но не размыто, возможно будет нужна обратная корректировка Очень очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# scaleBASmoothContrast
source: Сontrasty and may be present grid structure Very very fast - Very slow, and you can't process multiple images at the same time without losing speed
ru: Контрастно и может быть видна сеточная структура Очень очень быстро - Очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# scaleBAExtremum
source: Sharpen edges, but contrasty (for accuracy required reverse adjustment) and many Gibbs ringing artifacts Very very fast - Very slow, and you can't process multiple images at the same time without losing speed
ru: Чёткие края, но контрастно (для точности необходима обратная корректировка) и присутствует большой звон Очень очень быстро - Очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# scaleBAmonochrome
source: Smooth, curve and same time sharpness result, but monochrome (colors may be distorted) Very slow, and you can't process multiple images at the same time without losing speed
ru: Гладкий, криволинейный и в то же время чёткий результат, но монохромный (вследствие чего цвета могут искажаться) Очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# scaleBAmonochrome2
source: Sharpness edges, but colors may be distorted Very slow, and you can't process multiple images at the same time without losing speed
ru: Чёткие границы, но цвета могут искажаться Очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# scaleBilinearApproximation
source: A clearly defined grid structure and may be present Gibbs ringing artifacts, but it's better than nearest neighbour Very very fast - Very slow, and you can't process multiple images at the same time without losing speed
ru: Чётко видна сеточная структура и может присутствовать звон, но это лучше, чем ближайший сосед Очень очень быстро - Очень медленно, и Вы не можете обрабатывать несколько изображений одновременно

# ScaleFactor
source: Write or select required scale factor by two axes (2x-128x)
ru: Укажите масштаб увеличения (2x-128x)

# scaleFurry
source: Beautiful and detailed result, but only if bigger version must be monochrome image (only pure black and white, or for color - only pure red, black, green, yellow, fuchsia, blue, cyan and white) Very slow - Very very slow, but you can process multiple images at the same time without losing speed
ru: Потрясающе детализированный результат, но только, если результат должен быть монохромным (только чистый чёрный и белый, или для цветных изображений - чистые красный, чёрный, зелёный, жёлтый, фуксия, синий, голубой и белый) Очень медленно - очень очень медленно, но Вы можете обрабатывать несколько изображений одновременно без большой потери скорости

# scaleRough
source: Typographic raster stylization, but if bigger version must be monochrome image it gives acceptable upscaling Very slow, but you can process multiple images at the same time without losing speed
ru: Стилизация под микротипографику, но если результат должен быть монохромным это даёт приемлемый результат Очень медленно, но Вы можете обрабатывать несколько изображений одновременно без большой потери скорости

# scaleSeparate
source: Gives beatiful, but almost monochrome result and there are Gibbs ringing artifacts (to avoid you can try several times x2-x4) Very very fast - fast, but you can't process multiple images at the same time without losing speed
ru: Даёт прекрасный, но почти монохромный результат и присутствует звон (чтобы избежать этого попробуйте несколько раз прогнать через масштаб x2-x4) Очень очень быстро - Очень быстро, но Вы не можете обрабатывать одновременно несколько изображений без потери скорости

# ScaleSmooth
source: Most accurate for scenes where objects are completely in the image, but little bit blurred (much less than any interpolation) and grid structure is still visible Very fast - Slow, and you can process multiple images at the same time without losing speed
ru: Наиболее точно для сцен, где объекты полностью в кадре, но немного размыто (намного меньше, чем у любой интерполяции) и видна сеточная структура Очень быстро - медленно, но Вы не можете обрабатывать одновременно несколько изображений без потери скорости

# scaleSmoothContinuous
source: Most accurate for scenes where objects extend beyond the boundaries of the image, but little bit blurred (much less than any interpolation) and grid structure is still visible Very fast - Slow, and you can process multiple images at the same time without losing speed
ru: Наиболее точно для сцен, где объекты продолжаются за кадром, но немного размыто (намного меньше, чем у любой интерполяции) и видна сеточная структура Очень быстро - медленно, но Вы не можете обрабатывать одновременно несколько изображений без потери скорости

# ScaleSmoothContrast
source: Very smooth, after reverse adjustment - most accurate for any scenes, but very contrast and grid structure is still visible Slow, but you can process multiple images at the same time without losing speed
ru: Очень гладко, после обратной корректировки - наиболее точно для любых сцен, но очень сильно размыто и контрастно и сеточная структура видна в некоторых местах Медленно, но Вы можете обрабатывать одновременно несколько изображений без потери скорости

# SecSpent
source: seconds spent
ru: секунд прошло

# SoundNotification
source: Notify that processing is done by loud sound
ru: Уведомить, что обработка закончена громким звуком

# Start
source: Start processing with selected parameters Be careful - the process can be very long and it will be impossible to cancel it except with the close button or through the task manager
ru: Начать обработку с выбранными параметрами Будьте осторожны - процесс может быть очень долгим и его невозможно будет отменить, кроме как закрыть приложение или даже снять задачу через диспетчер задач

source: Upscale
ru: Начать

# UseGPU
source: Try increase perfomance by using your videocard? (It may interrupt other non-system GPU processes or actually decrease perfomance, results of CPU and GPU versions may differ slightly, GPU version may sometimes crashes) Square - Auto decide Check mark - Always Empty - Never
ru: Попробовать ускорить процесс за счёт видеокарты? (Это может прервать другие несистемные процессы на видеокарте или наоборот уменьшить скорость, результаты обычной версии и для видеокарты могут немного отличаться, версия для видеокарты может иногда вылетать) Квадрат - Aвтовыбор Галочка - Всегда Пусто - Никогда

# Wait
source: Calculating... %
ru: Обработка... %

# Resolution
source: Resolution of image buffer
ru: Разрешение картинки в буфере

source: ETA
ru: Осталось

# ImageMinRes
source: Mimimal resoulution of Image is 2x2
ru: Минимальное разрешение картинки 2х2
